Revit 2026 API

# GenericGenericBumpAmount Property

---

The property labeled "Amount" from the "Generic" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string GenericBumpAmount { get; }
```
```vb
Public Shared ReadOnly Property GenericBumpAmount As String
	Get
```
```cpp
public:
static property String^ GenericBumpAmount {
	String^ get ();
}
```
```fsharp
static member GenericBumpAmount : string with get
```

#### Property Value

String

This property is of type "AssetPropertyDouble" within the range of "-1000, 1000".

#### Reference

Generic Class

Autodesk.Revit.DB.Visual Namespace